AliBaWazir/bicycletechnologies_firmware-1/NRF51822/ble_app_rscs_c/pca10028/s130/arm5/RTE/nRF_Libraries/nRF51422_xxAC/nrf_log.h
/**@brief Function for logging a single character as HEX to raw UART.
 *
 * @details The output string is formatted as, for example, AA.
 *
 * This function is available only when NRF_LOG_USES_RAW_UART is defined as 1.
 *
 * @note This function is non-blocking. If too much data is sent to the UART,
 *          some characters might be skipped.
 *
 * @note Do not call this function directly. Use one of the following macros instead:
 * - @ref NRF_LOG_HEX_CHAR
 * - @ref NRF_LOG_HEX_CHAR_DEBUG
 * - @ref NRF_LOG_HEX_CHAR_ERROR
 *
 * @param c Character.
  */
void log_raw_uart_write_hex_char(uint8_t c);

/**@brief Function for checking if data is available in the input buffer.
 *
 * This function is available only when NRF_LOG_USES_RAW_UART is defined as 1.
 *
 * @note Do not call this function directly. Use @ref NRF_LOG_HAS_INPUT instead.
 *
 * @retval      1 If characters are available to read.
 * @retval      0 If no characters are available.
 */
int log_raw_uart_has_input(void);

/**@brief Function for reading one character from the input buffer.
 *
 * @param[out]   p_char  Pointer where to store the character.
 *
 * This function is available only when NRF_LOG_USES_RAW_UART is defined as 1.
 *
 * @note Do not call this function directly. Use NRF_LOG_READ_INPUT instead.
 *
 * @retval      NRF_SUCCESS If the character was read out.
 * @retval      NRF_ERROR_INVALID_DATA If no character could be read.
 */

uint32_t log_raw_uart_read_input(char* p_char);

#define NRF_LOG_INIT()                  log_raw_uart_init()                                                         /*!< nitialize the module. */

#define NRF_LOG_PRINTF(...)             log_raw_uart_printf(__VA_ARGS__)                                            /*!< Print a log message using printf. */
#define NRF_LOG_PRINTF_DEBUG(...)       log_raw_uart_printf(__VA_ARGS__)                                            /*!< If DEBUG is set, print a log message using printf. */
#define NRF_LOG_PRINTF_ERROR(...)       log_raw_uart_printf(__VA_ARGS__)                                            /*!< Print a log message using printf to the error stream. */

#define NRF_LOG(...)                    log_raw_uart_write_string_many(NUM_VA_ARGS(__VA_ARGS__), ##__VA_ARGS__)     /*!< Print a log message. The input string must be null-terminated. */
#define NRF_LOG_DEBUG(...)              log_raw_uart_write_string_many(NUM_VA_ARGS(__VA_ARGS__), ##__VA_ARGS__)     /*!< If DEBUG is set, print a log message. The input string must be null-terminated. */
#define NRF_LOG_ERROR(...)              log_raw_uart_write_string_many(NUM_VA_ARGS(__VA_ARGS__), ##__VA_ARGS__)     /*!< Print a log message to the error stream. The input string must be null-terminated. */

#define NRF_LOG_HEX(val)                log_raw_uart_write_hex(val)                                                 /*!< Log an integer as HEX value (example output: 0x89ABCDEF). */
#define NRF_LOG_HEX_DEBUG(val)          log_raw_uart_write_hex(val)                                                 /*!< If DEBUG is set, log an integer as HEX value (example output: 0x89ABCDEF). */
#define NRF_LOG_HEX_ERROR(val)          log_raw_uart_write_hex(val)                                                 /*!< Log an integer as HEX value to the error stream (example output: 0x89ABCDEF). */

#define NRF_LOG_HEX_CHAR(val)           log_raw_uart_write_hex_char(val)                                            /*!< Log a character as HEX value (example output: AA). */
#define NRF_LOG_HEX_CHAR_DEBUG(val)     log_raw_uart_write_hex_char(val)                                            /*!< If DEBUG is set, log a character as HEX value (example output: AA). */
#define NRF_LOG_HEX_CHAR_ERROR(val)     log_raw_uart_write_hex_char(val)                                            /*!< Log a character as HEX value to the error stream (example output: AA). */

#define NRF_LOG_HAS_INPUT()             log_raw_uart_has_input()                                                    /*!< Check if the input buffer has unconsumed characters. */
#define NRF_LOG_READ_INPUT(p_char)      log_raw_uart_read_input(p_char)                                             /*!< Consume a character from the input buffer. */

#if !defined(DEBUG) && !defined(DOXYGEN)

#undef NRF_LOG_DEBUG
#define NRF_LOG_DEBUG(...)

#undef NRF_LOG_PRINTF_DEBUG
#define NRF_LOG_PRINTF_DEBUG(...)

#undef NRF_LOG_STR_DEBUG
#define NRF_LOG_STR_DEBUG(...)

#undef NRF_LOG_HEX_DEBUG
#define NRF_LOG_HEX_DEBUG(...)

#undef NRF_LOG_HEX_CHAR_DEBUG
#define NRF_LOG_HEX_CHAR_DEBUG(...)

#endif // !defined(DEBUG) && !defined(DOXYGEN)

#else

#include "nrf_error.h"
#include "nordic_common.h"

// Empty definitions

__INLINE int dummy_func(void* ignore)
{
    UNUSED_PARAMETER(ignore);
    return NRF_SUCCESS;
}

#define NRF_LOG_INIT()                 dummy_func(0)
#define NRF_LOG(...)
#define NRF_LOG_DEBUG(...)
#define NRF_LOG_ERROR(...)

#define NRF_LOG_PRINTF(...)
#define NRF_LOG_PRINTF_DEBUG(...)
#define NRF_LOG_PRINTF_ERROR(...)

#define NRF_LOG_HEX(val)
#define NRF_LOG_HEX_DEBUG(val)
#define NRF_LOG_HEX_ERROR(val)

#define NRF_LOG_HEX_CHAR(val)
#define NRF_LOG_HEX_CHAR_DEBUG(val)
#define NRF_LOG_HEX_CHAR_ERROR(val)

#define NRF_LOG_HAS_INPUT()              0
#define NRF_LOG_READ_INPUT(ignore)       dummy_func(ignore)

#endif

/**@brief Function for writing HEX values.
 *
 * @note This function not thread-safe. It is written for convenience.
 *          If you log from different application contexts, you might get different results.
 *
 * @retval NULL By default.
 */
const char* log_hex(uint32_t value);

/**@brief Function for writing HEX characters.
 *
 * @note This function not thread-safe. It is written for convenience.
 *          If you log from different application contexts, you might get different results.
 *
 * @retval NULL By default.
 */
const char* log_hex_char(const char value);




#else // DOXYGEN

/** @defgroup nrf_log UART/RTT logging
 * @{
 * @ingroup app_common
 *
 * @brief Library to output logging information over SEGGER's Real Time Transfer
 *       (RTT), UART, or raw UART.
 *
 * This library provides macros that call the respective functions depending on 
 * which protocol is used. Define LOG_USES_RTT=1 to enable logging over RTT, 
 * NRF_LOG_USES_UART=1 to enable logging over UART, or NRF_LOG_USES_RAW_UART=1 
 * to enable logging over raw UART. One of these defines must be set for any of 
 * the macros to have effect. If you choose to not output information, all 
 * logging macros can be left in the code without any cost; they will just be 
 * ignored.
 */



/**@brief Macro for initializing the logger.
 *
 * @retval     NRF_SUCCESS     If initialization was successful.
 * @retval     NRF_ERROR       Otherwise.
 */
uint32_t NRF_LOG_INIT(void);

/**@brief Macro for logging null-terminated strings.
 *
 * @details This function is more efficient than using printf.
 *          The null termination will not be logged.
 *
 * @param  msg  Null-terminated string.
 */
void NRF_LOG(const char* msg);

/**@brief Macro for logging a printf string.
 *
 * @details  Printf requires more processor time
 * than other logging functions. Therefore, applications that require logging
 * but need it to interfere as little as possible with the execution, should
 * avoid using printf.
 *
 * @note When NRF_LOG_USES_UART is set to 1, this macro is non-blocking. 
 *       If too much data is sent, some characters might be skipped.
 *
 * @param  format_msg      Printf format string.
 * @param  ...             Additional arguments replacing format specifiers in format_msg.
 */
void NRF_LOG_PRINTF(const char * format_msg, ...);

/**@brief Macro for logging an integer value as HEX.
 *
 * @details The output data is formatted as, for example, 0x89ABCDEF.
 * This function is more efficient than printf.
 *
 * @note When NRF_LOG_USES_UART is set to 1, this macro is non-blocking. 
 *       If too much data is sent, some characters might be skipped.
 *
 * @param   value   Integer value to be printed as HEX.
 */
void NRF_LOG_HEX(uint32_t value);

/**@brief Macro for logging a single character as HEX.
 *
 * @details The output string is formatted as, for example, AA.
 *
 * @note When NRF_LOG_USES_UART is set to 1, this macro is non-blocking. 
 *       If too much data is sent, some characters might be skipped.
 *
 * @param c Character.
  */
void NRF_LOG_HEX_CHAR(uint8_t c);

/**@brief Macro for checking if data is available in the input buffer.
 *
 * @note When NRF_LOG_USES_UART is set to 1, this macro is non-blocking. 
 *       If too much data is sent, some characters might be skipped.
 *
 * @retval      1 If characters are available to read.
 * @retval      0 If no characters are available.
 */
int NRF_LOG_HAS_INPUT(void);

/**@brief Macro for reading one character from the input buffer.
 *
 * @param[out]   p_char  Pointer where to store the character.
 *
 * @retval      NRF_SUCCESS If the character was read out.
 * @retval      NRF_ERROR_INVALID_DATA If no character could be read.
 */
uint32_t NRF_LOG_READ_INPUT(char* p_char);

/** @} */
#endif // DOXYGEN
#endif // NRF_LOG_H_
